clc;
clear;
close all;


%% Fig.球体水平位置估计精度 vs 深度 ，信噪比20
% 数据

Dehths=[0.4 0.5 0.6 0.7 0.8 0.9 1];
m_alpha=[ 
         0.0045    0.0043    0.0615    1.3429    1.3441    2.0372    0.0071    0.0373    0.0350;...
         0.0037    0.0038    0.0171    0.2995    0.2972    0.6860    0.0199    0.0700    0.0738;...
         0.0036    0.0032    0.0396    0.5839    0.5819    1.0578    0.0119    0.0336    0.0303;...
         0.0033    0.0034    0.0136    0.1702    0.1680    0.3474    0.0147    0.0342    0.0358;...
         0.0030    0.0027    0.0425    0.4611    0.4606    0.8786    0.0134    0.0221    0.0206;...
         0.0028    0.0029    0.0176    0.1646    0.1638    0.3465    0.0163    0.0225    0.0234;...
         0.0024    0.0028    0.0559    0.4970    0.4937    0.9163    0.0134    0.0153    0.0169;...
         ];
v_ehor=100*sqrt(sum(m_alpha(:,1:2).^2,2));
v_edepth=100*m_alpha(:,3);

% 绘图
fig2=figure('name','球体深度估计误差 vs SNR');

% linestyles={'-bo','-rd','-cs','-k^','-gv','-m*'};	%marker类型
plot(100*Dehths,v_edepth,'-bo');
xlabel('\fontsize{12}\fontname{宋体}深度/cm');
ylabel('\fontsize{12}\fontname{宋体}球体深度估计误差/cm');
grid on;
title('深度估计误差 vs 深度');
set(gca,'FontSize',12,'FontName', '宋体'); 
set(gca,'LineWidth',1);                                 % 坐标轴框线粗细
print(fig2,'output/球体深度估计精度 vs 深度',"-dpng","-r600");