clc;
clear;
close all;


%% Fig.球体水平位置估计精度 vs SNR
% 数据
v_true=[  0         0   -1.0000   90.0000   90.0000         0    1.7317    1.7317    3.0060]; % 位置，姿态，主轴极化率
amp=sqrt(sum(v_true(4:9).^2));
Phi=[0 45 90];
Thetas=[0 15 30 45 60 75 90];
len=length(Thetas);
m_alpha_0=[
         -0.0028   -0.0046   -1.0002    1.2217    2.1052   67.5939    1.7185    1.7278    2.9961;...% 0 
         -0.0004    0.0037   -0.9979    0.4557    2.3522   72.6602    1.7267    1.7661    3.0036;...% 15
         -0.0056    0.0090   -0.9951    1.6028    3.8684   38.2674    1.7157    1.7666    2.9261;...% 30
         -0.0064    0.0077   -0.9942    0.6179    1.9989   41.6116    1.6870    1.7130    2.9071;...% 45
         0.0036   -0.0060   -1.0089    1.0113    0.1007   28.4298    1.8023    1.8207    3.1455;...% 60
         0.0017    0.0022   -1.0064    0.2557    0.7083   15.0320    1.7666    1.7808    3.0784;...% 75
         -0.0013   -0.0127   -1.0145    0.6110   25.1924    0.1335    1.8415    1.8917    3.1792;...% 90
         ];
m_alpha_45=[
           -0.0004   -0.0144   -1.0058    0.5502    2.8402   90.0000    1.7588    1.7676    3.2202;...% 0 
        -0.0023    0.0009   -1.0006    0.1663    0.4178   90.0000    1.7213    1.7356    3.0024;...% 15
         -0.0019   -0.0005   -0.9983    0.6074    0.2737   90.0000    1.6933    1.7202    2.9753;...% 30
         0.0001    0.0002   -1.0033    0.2283    0.9172   76.7204    1.7447    1.7904    3.0497;...% 45
         -0.0002    0.0020   -1.0004    0.0228    0.3787   41.5636    1.7225    1.7374    2.9997;...% 60
         0.0004    0.0025   -0.9985    0.0305    0.8277   21.0331    1.7246    1.7420    3.0021;...% 75
         -0.0012   -0.0121   -1.0176    0.5014   23.7145    0.0521    1.8341    1.9108    3.2037;...% 90
         ];
m_alpha_90=[
         0.0025   -0.0031   -1.0081    0.1073    0.3723   90.0000    1.7579    1.7975    3.1079;...% 0 
         -0.0005   -0.0047   -1.0059    0.4345    0.4692   90.0000    1.7615    1.7878    3.1026;...% 15
         0.0034    0.0002   -0.9981    0.8034    1.3921   90.0000    1.7138    1.7743    3.0344;...% 30
         0.0046   -0.0040   -1.0117    0.4982    0.4270   90.0000    1.8172    1.8380    3.1682;...% 45
         -0.0008    0.0000   -1.0058    0.5367    0.3291   90.0000    1.7841    1.7876    3.0833;...% 60
         -0.0005    0.0007   -1.0107    0.1326    1.2681   90.0000    1.7907    1.8178    3.1129;...% 75
         -0.0004   -0.0058   -1.0079    0.2705   54.1939    0.1697    1.7986    1.8043    3.0952;...% 90
         ];
v_ehor_0=100*sqrt(sum((m_alpha_0(:,1:3)-repmat(v_true(1:3),len,1)).^2,2));
v_beta_0=100*sqrt(sum((m_alpha_0(:,7:9)-repmat(v_true(7:9),len,1)).^2,2))/sqrt(sum(v_true(7:9).^2,2));
v_ehor_45=100*sqrt(sum((m_alpha_45(:,1:3)-repmat(v_true(1:3),len,1)).^2,2));
v_beta_45=100*sqrt(sum((m_alpha_45(:,7:9)-repmat(v_true(7:9),len,1)).^2,2))/sqrt(sum(v_true(7:9).^2,2));
v_ehor_90=100*sqrt(sum((m_alpha_90(:,1:3)-repmat(v_true(1:3),len,1)).^2,2));
v_beta_90=100*sqrt(sum((m_alpha_90(:,7:9)-repmat(v_true(7:9),len,1)).^2,2))/sqrt(sum(v_true(7:9).^2,2));
% v_betay=100*abs(m_alpha_0(:,8)-repmat(v_true(8),len,1))./repmat(v_true(8),len,1);
% v_betaz=100*abs(m_alpha_0(:,9)-repmat(v_true(9),len,1))./repmat(v_true(9),len,1);
% 绘图
fig1=figure('name','圆柱形物体位置误差 vs 俯仰角\theta');

% linestyles={'-bo','-rd','-cs','-k^','-gv','-m*'};	%marker类型
plot(Thetas,v_ehor_0,'-bo');
hold on;
plot(Thetas,v_ehor_45,'-rd');
plot(Thetas,v_ehor_90,'-k^');
xlabel('\fontsize{12}\fontname{宋体}俯仰角\theta/^0');
ylabel('\fontsize{12}\fontname{宋体}位置误差/cm');
legend('侧倾角\phi=0^0','侧倾角\phi=45^0','侧倾角\phi=90^0');
grid on;
title('圆柱形物体位置误差 vs 俯仰角\theta');
set(gca,'FontSize',12,'FontName', '宋体'); 
set(gca,'LineWidth',1);                                 % 坐标轴框线粗细

% 绘图
fig2=figure('name','球体深度估计精度 vs SNR');

% linestyles={'-bo','-rd','-cs','-k^','-gv','-m*'};	%marker类型
plot(Thetas,v_beta_0,'-bo');
hold on;
plot(Thetas,v_beta_45,'-rd');
plot(Thetas,v_beta_90,'-k^');
xlabel('\fontsize{12}\fontname{宋体}俯仰角\theta/^0');
ylabel('\fontsize{12}\fontname{宋体}主轴极化率误差/%');
grid on;
title('主轴极化率误差 vs 俯仰角\theta');

legend('侧倾角\phi=0^0','侧倾角\phi=45^0','侧倾角\phi=90^0');
set(gca,'FontSize',12,'FontName', '宋体'); 
set(gca,'LineWidth',1);                                 % 坐标轴框线粗细
% print(fig1,'output/球体位置误差 vs SNR vs SNR',"-dpng","-r600");
% print(fig2,'output/球体主轴极化率误差 vs SNR',"-dpng","-r600");